
## :x: Apply Failed

[CI link](https://github.com/hayas1/tfgh/actions/runs/11878820199)



<pre><code>Error: unexpected status code: 404 Not Found

  with module.repositories[&#34;devcontainer-features&#34;].github_repository_file.this[&#34;github/pull_request_template.md&#34;],
  on module/repository/files.tf line 35, in resource &#34;github_repository_file&#34; &#34;this&#34;:
  35: resource &#34;github_repository_file&#34; &#34;this&#34; {


Error: unexpected status code: 404 Not Found

  with module.repositories[&#34;devcontainer-features&#34;].github_repository_file.this[&#34;github/labeler.yml&#34;],
  on module/repository/files.tf line 35, in resource &#34;github_repository_file&#34; &#34;this&#34;:
  35: resource &#34;github_repository_file&#34; &#34;this&#34; {


Error: unexpected status code: 404 Not Found

  with module.repositories[&#34;devcontainer-features&#34;].github_repository_file.this[&#34;github/workflows/labeler.yml&#34;],
  on module/repository/files.tf line 35, in resource &#34;github_repository_file&#34; &#34;this&#34;:
  35: resource &#34;github_repository_file&#34; &#34;this&#34; {


Error: unexpected status code: 404 Not Found

  with module.repositories[&#34;devcontainer-features&#34;].github_repository_file.this[&#34;github/release.yml&#34;],
  on module/repository/files.tf line 35, in resource &#34;github_repository_file&#34; &#34;this&#34;:
  35: resource &#34;github_repository_file&#34; &#34;this&#34; {


Error: unexpected status code: 404 Not Found

  with module.repositories[&#34;devcontainer-features&#34;].github_repository_file.this[&#34;github/issue_template.md&#34;],
  on module/repository/files.tf line 35, in resource &#34;github_repository_file&#34; &#34;this&#34;:
  35: resource &#34;github_repository_file&#34; &#34;this&#34; {


Error: unexpected status code: 404 Not Found

  with module.repositories[&#34;tfgh&#34;].github_repository_file.this[&#34;github/issue_template.md&#34;],
  on module/repository/files.tf line 35, in resource &#34;github_repository_file&#34; &#34;this&#34;:
  35: resource &#34;github_repository_file&#34; &#34;this&#34; {

::error::Terraform exited with code 1.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
module.repositories["devcontainer-features"].github_repository.this: Refreshing state... [id=devcontainer-features]
module.repositories["json-with-comments"].github_repository.this: Refreshing state... [id=json-with-comments]
module.repositories["dyson-rs"].github_repository.this: Refreshing state... [id=dyson-rs]
module.repositories["tfgh"].github_repository.this: Refreshing state... [id=tfgh]
module.repositories["tokei-toukei"].github_repository.this: Refreshing state... [id=tokei-toukei]
module.repositories["json-with-comments"].github_branch_default.this: Refreshing state... [id=json-with-comments]
module.repositories["tokei-toukei"].github_branch_default.this: Refreshing state... [id=tokei-toukei]
module.repositories["dyson-rs"].github_branch_default.this: Refreshing state... [id=dyson-rs]
module.repositories["tfgh"].github_branch_default.this: Refreshing state... [id=tfgh]
module.repositories["devcontainer-features"].github_branch_default.this: Refreshing state... [id=devcontainer-features]
module.repositories["tfgh"].github_repository_ruleset.this: Refreshing state... [id=2558597]
module.repositories["json-with-comments"].github_repository_ruleset.this: Refreshing state... [id=2629668]
module.repositories["devcontainer-features"].github_repository_ruleset.this: Refreshing state... [id=2602488]
module.repositories["tokei-toukei"].github_repository_ruleset.this: Refreshing state... [id=2639488]
module.repositories["dyson-rs"].github_repository_ruleset.this: Refreshing state... [id=2589508]
module.repositories["devcontainer-features"].github_issue_label.this["breaking"]: Refreshing state... [id=devcontainer-features:breaking]
module.repositories["devcontainer-features"].github_issue_label.this["maintenance"]: Refreshing state... [id=devcontainer-features:maintenance]
module.repositories["json-with-comments"].github_issue_label.this["deps"]: Refreshing state... [id=json-with-comments:deps]
module.repositories["dyson-rs"].github_issue_label.this["bugfix"]: Refreshing state... [id=dyson-rs:bugfix]
module.repositories["tfgh"].github_issue_label.this["maintenance"]: Refreshing state... [id=tfgh:maintenance]
module.repositories["tokei-toukei"].github_issue_label.this["maintenance"]: Refreshing state... [id=tokei-toukei:maintenance]
module.repositories["tokei-toukei"].github_issue_label.this["deps"]: Refreshing state... [id=tokei-toukei:deps]
module.repositories["dyson-rs"].github_issue_label.this["maintenance"]: Refreshing state... [id=dyson-rs:maintenance]
module.repositories["dyson-rs"].github_issue_label.this["deps"]: Refreshing state... [id=dyson-rs:deps]
module.repositories["devcontainer-features"].github_issue_label.this["documentation"]: Refreshing state... [id=devcontainer-features:documentation]
module.repositories["devcontainer-features"].github_issue_label.this["feature"]: Refreshing state... [id=devcontainer-features:feature]
module.repositories["tfgh"].github_issue_label.this["bugfix"]: Refreshing state... [id=tfgh:bugfix]
module.repositories["tfgh"].github_issue_label.this["refactor"]: Refreshing state... [id=tfgh:refactor]
module.repositories["tfgh"].github_issue_label.this["feature"]: Refreshing state... [id=tfgh:feature]
module.repositories["devcontainer-features"].github_issue_label.this["refactor"]: Refreshing state... [id=devcontainer-features:refactor]
module.repositories["tokei-toukei"].github_issue_label.this["bugfix"]: Refreshing state... [id=tokei-toukei:bugfix]
module.repositories["tfgh"].github_issue_label.this["deps"]: Refreshing state... [id=tfgh:deps]
module.repositories["tokei-toukei"].github_issue_label.this["refactor"]: Refreshing state... [id=tokei-toukei:refactor]
module.repositories["json-with-comments"].github_issue_label.this["refactor"]: Refreshing state... [id=json-with-comments:refactor]
module.repositories["dyson-rs"].github_issue_label.this["documentation"]: Refreshing state... [id=dyson-rs:documentation]
module.repositories["json-with-comments"].github_issue_label.this["maintenance"]: Refreshing state... [id=json-with-comments:maintenance]
module.repositories["dyson-rs"].github_issue_label.this["feature"]: Refreshing state... [id=dyson-rs:feature]
module.repositories["tokei-toukei"].github_issue_label.this["breaking"]: Refreshing state... [id=tokei-toukei:breaking]
module.repositories["dyson-rs"].github_issue_label.this["refactor"]: Refreshing state... [id=dyson-rs:refactor]
module.repositories["tfgh"].github_issue_label.this["breaking"]: Refreshing state... [id=tfgh:breaking]
module.repositories["json-with-comments"].github_issue_label.this["bugfix"]: Refreshing state... [id=json-with-comments:bugfix]
module.repositories["json-with-comments"].github_issue_label.this["documentation"]: Refreshing state... [id=json-with-comments:documentation]
module.repositories["tfgh"].github_issue_label.this["documentation"]: Refreshing state... [id=tfgh:documentation]
module.repositories["devcontainer-features"].github_issue_label.this["bugfix"]: Refreshing state... [id=devcontainer-features:bugfix]
module.repositories["dyson-rs"].github_issue_label.this["breaking"]: Refreshing state... [id=dyson-rs:breaking]
module.repositories["devcontainer-features"].github_issue_label.this["deps"]: Refreshing state... [id=devcontainer-features:deps]
module.repositories["tokei-toukei"].github_issue_label.this["documentation"]: Refreshing state... [id=tokei-toukei:documentation]
module.repositories["json-with-comments"].github_issue_label.this["feature"]: Refreshing state... [id=json-with-comments:feature]
module.repositories["json-with-comments"].github_issue_label.this["breaking"]: Refreshing state... [id=json-with-comments:breaking]
module.repositories["tokei-toukei"].github_issue_label.this["feature"]: Refreshing state... [id=tokei-toukei:feature]
module.repositories["devcontainer-features"].data.github_repository_file.default_readme: Reading...
module.repositories["json-with-comments"].data.github_repository_file.default_readme: Reading...
module.repositories["tfgh"].data.github_repository_file.default_readme: Reading...
module.repositories["tokei-toukei"].data.github_repository_file.default_readme: Reading...
module.repositories["dyson-rs"].data.github_repository_file.default_readme: Reading...
module.repositories["devcontainer-features"].data.github_repository_file.default_readme: Read complete after 3s [id=devcontainer-features/README.md]
module.repositories["json-with-comments"].data.github_repository_file.default_readme: Read complete after 3s [id=json-with-comments/README.md]
module.repositories["tfgh"].data.github_repository_file.default_readme: Read complete after 3s [id=tfgh/README.md]
module.repositories["tokei-toukei"].data.github_repository_file.default_readme: Read complete after 3s [id=tokei-toukei/README.md]
module.repositories["dyson-rs"].data.github_repository_file.default_readme: Read complete after 4s [id=dyson-rs/README.md]
module.repositories["devcontainer-features"].github_repository_file.readme: Refreshing state... [id=devcontainer-features/README.md]
module.repositories["tokei-toukei"].github_repository_file.readme: Refreshing state... [id=tokei-toukei/README.md]
module.repositories["tfgh"].github_repository_file.readme: Refreshing state... [id=tfgh/README.md]
module.repositories["dyson-rs"].github_repository_file.readme: Refreshing state... [id=dyson-rs/README.md]
module.repositories["json-with-comments"].github_repository_file.readme: Refreshing state... [id=json-with-comments/README.md]
module.repositories["tfgh"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=tfgh/.github/release.yml]
module.repositories["json-with-comments"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=json-with-comments/.github/release.yml]
module.repositories["devcontainer-features"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=devcontainer-features/.github/release.yml]
module.repositories["dyson-rs"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=dyson-rs/.github/pull_request_template.md]
module.repositories["dyson-rs"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=dyson-rs/.github/issue_template.md]
module.repositories["json-with-comments"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=json-with-comments/.github/pull_request_template.md]
module.repositories["devcontainer-features"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=devcontainer-features/.github/issue_template.md]
module.repositories["tfgh"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=tfgh/.github/workflows/labeler.yml]
module.repositories["json-with-comments"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=json-with-comments/.github/labeler.yml]
module.repositories["tokei-toukei"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=tokei-toukei/.github/issue_template.md]
module.repositories["json-with-comments"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=json-with-comments/.github/workflows/labeler.yml]
module.repositories["json-with-comments"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=json-with-comments/.github/issue_template.md]
module.repositories["tokei-toukei"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=tokei-toukei/.github/labeler.yml]
module.repositories["devcontainer-features"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=devcontainer-features/.github/labeler.yml]
module.repositories["tfgh"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=tfgh/.github/issue_template.md]
module.repositories["devcontainer-features"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=devcontainer-features/.github/pull_request_template.md]
module.repositories["dyson-rs"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=dyson-rs/.github/workflows/labeler.yml]
module.repositories["tokei-toukei"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=tokei-toukei/.github/workflows/labeler.yml]
module.repositories["tfgh"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=tfgh/.github/pull_request_template.md]
module.repositories["devcontainer-features"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=devcontainer-features/.github/workflows/labeler.yml]
module.repositories["tokei-toukei"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=tokei-toukei/.github/pull_request_template.md]
module.repositories["dyson-rs"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=dyson-rs/.github/labeler.yml]
module.repositories["dyson-rs"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=dyson-rs/.github/release.yml]
module.repositories["tfgh"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=tfgh/.github/labeler.yml]
module.repositories["tokei-toukei"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=tokei-toukei/.github/release.yml]
module.repositories["devcontainer-features"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:devcontainer-features:43]
module.repositories["dyson-rs"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:dyson-rs:11]
module.repositories["tfgh"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:tfgh:75]
module.repositories["json-with-comments"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:json-with-comments:46]
module.repositories["tokei-toukei"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:tokei-toukei:27]
github_repository_environment.plan: Refreshing state... [id=tfgh:plan]
github_issue_label.manual: Refreshing state... [id=tfgh:manual]
github_repository_environment.apply: Refreshing state... [id=tfgh:apply]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repositories["devcontainer-features"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"94e1c53411a9718b6a378eccd0853cad242a2dbb1f0177fcb6658cd8be2185eb\"" -> "W/\"83ddd45f6dfe36b426f4ea3cb2435f9dd8d06d8e78cab6de48ec1ed535883c73\""
        id                          = "devcontainer-features"
        name                        = "devcontainer-features"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["dyson-rs"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"4a14b9003b2e588f5dd39e5e8b8679eee39333bc48aeb67ecd5039f0829c92f6\"" -> "W/\"992b912b0072b962cefe93e8d26864022bc3e67ae024d3f4b9a7b671816ae840\""
        id                          = "dyson-rs"
        name                        = "dyson-rs"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["json-with-comments"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"eaa9dfd2282d066137c77033b9b5d8bbb0be1b2fb6a30f570dd51bb0cb0cb380\"" -> "W/\"35530d13d1f4c11d4b3a97d449d4c8ce99c49a4c9506f4475e6829adf0f10f85\""
        id                          = "json-with-comments"
        name                        = "json-with-comments"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["tfgh"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"42627156b1e129b54b422a821a3f7f75a81f94db0d6083050820c0194cffef4d\"" -> "W/\"2126fc406be325537b34352343da63accb06756f7cfdfed74723dab2cf2123ae\""
        id                          = "tfgh"
        name                        = "tfgh"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["tokei-toukei"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"c2a00d154f4ca8efb94abffac561ea688854ade452fdb16b5d450042cddf0355\"" -> "W/\"304f7cf5784ca37e5a7374137eb50324659db4ec464b0b9ac8dc2fd56ff46448\""
        id                          = "tokei-toukei"
        name                        = "tokei-toukei"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.repositories["devcontainer-features"].github_repository_file.this["github/issue_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/issue_template.md"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            <!-- This template is managed by terraform. https://github.com/hayas1/tfgh -->
            
            ## Expectation :butterfly:
            > [Delete me] What behavior is expected?
            
            ## Reality :bug:
            > [Delete me] How does it actually work?
            
            ## Environment :evergreen_tree:
            > [Delete me] (When and) Where the behavior was observed?
            
            ## Cause :mag:
            > [Delete me] Why this issue was occurred?
            
            ## Related :chains:
            > [Delete me] The list of related issues or pull requests
            
            ## Remark :eyes:
            > [Delete me] Any remarks
        EOT
      + file                         = ".github/issue_template.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "devcontainer-features"
      + sha                          = (known after apply)
    }

  # module.repositories["devcontainer-features"].github_repository_file.this["github/labeler.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/labeler.yml"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # Managed by terraform. https://github.com/hayas1/tfgh
            
            feature:
              - head-branch:
                - '^feat/'
                - '^feature/'
            
            breaking:
              - head-branch:
                - '^breaking/'
            
            bugfix:
              - head-branch:
                - '^fix/'
                - '^bugfix/'
                - '^modify/'
            
            refactor:
              - head-branch:
                - '^refactor/'
            
            documentation:
              - changed-files:
                - any-glob-to-any-file:
                  - '**/README.md'
              - head-branch:
                - '^doc/'
                - '^docs/'
                - '^documentation/'
            
            deps:
              - head-branch:
                - '^dep/'
                - '^deps/'
                - '^dependencies/'
            
            maintenance:
              - changed-files:
                - any-glob-to-any-file:
                  - '.github/**'
              - head-branch:
                - '^maintenance/'
                - '^ci/'
                - '^workflow/'
                - '^chore/'
        EOT
      + file                         = ".github/labeler.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "devcontainer-features"
      + sha                          = (known after apply)
    }

  # module.repositories["devcontainer-features"].github_repository_file.this["github/pull_request_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/pull_request_template.md"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            <!-- This template is managed by terraform. https://github.com/hayas1/tfgh -->
            
            ## Overview :rocket:
            > [Delete me] What is this pull request?
            
            ## Implementation :clamp:
            > [Delete me] How to realize ?
            
            ## Use cases :chopsticks:
            > [Delete me] Why this pull request was created?
            
            ## Testing :gear:
            > [Delete me] Testing steps
            
            ## Related :chains:
            > [Delete me] The list of related issues or pull requests
            
            ## Remark :eyes:
            > [Delete me] Any remarks
        EOT
      + file                         = ".github/pull_request_template.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "devcontainer-features"
      + sha                          = (known after apply)
    }

  # module.repositories["devcontainer-features"].github_repository_file.this["github/release.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/release.yml"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # Managed by terraform. https://github.com/hayas1/tfgh
            
            changelog:
              categories:
                - title: '🚀 Features'
                  labels:
                    - feature
                - title: '🔨 Breaking Changes'
                  labels:
                    - breaking
                - title: '🐛 Bug Fixes'
                  labels:
                    - bugfix
                - title: '🔧 Refactoring'
                  labels:
                    - refactor
                - title: '📖 Documentation'
                  labels:
                    - documentation
                - title: '👒 Dependency update'
                  labels:
                    - deps
                - title: '🧰 Maintenance'
                  labels:
                    - maintenance
                - title: Other Changes
                  labels:
                    - "*"
        EOT
      + file                         = ".github/release.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "devcontainer-features"
      + sha                          = (known after apply)
    }

  # module.repositories["devcontainer-features"].github_repository_file.this["github/workflows/labeler.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/workflows/labeler.yml"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # Managed by terraform. https://github.com/hayas1/tfgh
            
            name: Pull Request Labeler
            on:
            - pull_request_target
            
            jobs:
              labeler:
                permissions:
                  contents: read
                  pull-requests: write
                runs-on: ubuntu-latest
                steps:
                - uses: actions/labeler@v5
        EOT
      + file                         = ".github/workflows/labeler.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "devcontainer-features"
      + sha                          = (known after apply)
    }

  # module.repositories["dyson-rs"].github_repository_file.this["github/issue_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content             = <<-EOT
          - <!-- Managed by terraform. https://github.com/hayas1/tfgh -->
          + <!-- This template is managed by terraform. https://github.com/hayas1/tfgh -->
            
            ## Expectation :butterfly:
            > [Delete me] What behavior is expected?
            
            ## Reality :bug:
            > [Delete me] How does it actually work?
            
            ## Environment :evergreen_tree:
            > [Delete me] (When and) Where the behavior was observed?
            
            ## Cause :mag:
            > [Delete me] Why this issue was occurred?
            
            ## Related :chains:
            > [Delete me] The list of related issues or pull requests
            
            ## Remark :eyes:
            > [Delete me] Any remarks
        EOT
        id                  = "dyson-rs/.github/issue_template.md"
        # (8 unchanged attributes hidden)
    }

  # module.repositories["dyson-rs"].github_repository_file.this["github/pull_request_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content                         = <<-EOT
          - <!-- Managed by terraform. https://github.com/hayas1/tfgh -->
          + <!-- This template is managed by terraform. https://github.com/hayas1/tfgh -->
            
            ## Overview :rocket:
            > [Delete me] What is this pull request?
            
            ## Implementation :clamp:
            > [Delete me] How to realize ?
            
            ## Use cases :chopsticks:
            > [Delete me] Why this pull request was created?
            
            ## Testing :gear:
            > [Delete me] Testing steps
            
            ## Related :chains:
            > [Delete me] The list of related issues or pull requests
            
            ## Remark :eyes:
            > [Delete me] Any remarks
        EOT
        id                              = "dyson-rs/.github/pull_request_template.md"
        # (11 unchanged attributes hidden)
    }

  # module.repositories["dyson-rs"].github_repository_pull_request.managed will be replaced due to changes in replace_triggered_by
-/+ resource "github_repository_pull_request" "managed" {
      ~ base_sha              = "d94a2b4dc8f49e29b32e8c7e9f43c3b58667fa8e" -> (known after apply)
      ~ draft                 = false -> (known after apply)
      ~ head_sha              = "b6cde762ac475754edf60a50116aa07f87f21f55" -> (known after apply)
      ~ id                    = "hayas1:dyson-rs:11" -> (known after apply)
      ~ labels                = [
          - "documentation",
          - "maintenance",
        ] -> (known after apply)
      ~ number                = 11 -> (known after apply)
      ~ opened_at             = 1731818012 -> (known after apply)
      ~ opened_by             = "terraform-apply[bot]" -> (known after apply)
      ~ state                 = "open" -> (known after apply)
      ~ updated_at            = 1731818023 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.repositories["json-with-comments"].github_repository_file.this["github/issue_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content             = <<-EOT
          - <!-- Managed by terraform. https://github.com/hayas1/tfgh -->
          + <!-- This template is managed by terraform. https://github.com/hayas1/tfgh -->
            
            ## Expectation :butterfly:
            > [Delete me] What behavior is expected?
            
            ## Reality :bug:
            > [Delete me] How does it actually work?
            
            ## Environment :evergreen_tree:
            > [Delete me] (When and) Where the behavior was observed?
            
            ## Cause :mag:
            > [Delete me] Why this issue was occurred?
            
            ## Related :chains:
            > [Delete me] The list of related issues or pull requests
            
            ## Remark :eyes:
            > [Delete me] Any remarks
        EOT
        id                  = "json-with-comments/.github/issue_template.md"
        # (8 unchanged attributes hidden)
    }

  # module.repositories["json-with-comments"].github_repository_file.this["github/pull_request_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content             = <<-EOT
          - <!-- Managed by terraform. https://github.com/hayas1/tfgh -->
          + <!-- This template is managed by terraform. https://github.com/hayas1/tfgh -->
            
            ## Overview :rocket:
            > [Delete me] What is this pull request?
            
            ## Implementation :clamp:
            > [Delete me] How to realize ?
            
            ## Use cases :chopsticks:
            > [Delete me] Why this pull request was created?
            
            ## Testing :gear:
            > [Delete me] Testing steps
            
            ## Related :chains:
            > [Delete me] The list of related issues or pull requests
            
            ## Remark :eyes:
            > [Delete me] Any remarks
        EOT
        id                  = "json-with-comments/.github/pull_request_template.md"
        # (8 unchanged attributes hidden)
    }

  # module.repositories["json-with-comments"].github_repository_pull_request.managed will be replaced due to changes in replace_triggered_by
-/+ resource "github_repository_pull_request" "managed" {
      ~ base_sha              = "5cc937a63844a086691695303161c7ae382336d9" -> (known after apply)
      ~ draft                 = false -> (known after apply)
      ~ head_sha              = "fd7d586ada1de406cd6e60c7ede7c74761978882" -> (known after apply)
      ~ id                    = "hayas1:json-with-comments:46" -> (known after apply)
      ~ labels                = [
          - "maintenance",
        ] -> (known after apply)
      ~ number                = 46 -> (known after apply)
      ~ opened_at             = 1731818015 -> (known after apply)
      ~ opened_by             = "terraform-apply[bot]" -> (known after apply)
      ~ state                 = "open" -> (known after apply)
      ~ updated_at            = 1731818026 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.repositories["tfgh"].github_repository_file.this["github/issue_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/issue_template.md"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            <!-- This template is managed by terraform. https://github.com/hayas1/tfgh -->
            
            ## Expectation :butterfly:
            > [Delete me] What behavior is expected?
            
            ## Reality :bug:
            > [Delete me] How does it actually work?
            
            ## Environment :evergreen_tree:
            > [Delete me] (When and) Where the behavior was observed?
            
            ## Cause :mag:
            > [Delete me] Why this issue was occurred?
            
            ## Related :chains:
            > [Delete me] The list of related issues or pull requests
            
            ## Remark :eyes:
            > [Delete me] Any remarks
        EOT
      + file                         = ".github/issue_template.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "tfgh"
      + sha                          = (known after apply)
    }

  # module.repositories["tfgh"].github_repository_file.this["github/pull_request_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content                         = <<-EOT
          - <!-- Managed by terraform. https://github.com/hayas1/tfgh -->
          + <!-- This template is managed by terraform. https://github.com/hayas1/tfgh -->
            
            ## Overview :rocket:
            > [Delete me] What is this pull request?
            
            ## Implementation :clamp:
            > [Delete me] How to realize ?
            
            ## Use cases :chopsticks:
            > [Delete me] Why this pull request was created?
            
            ## Testing :gear:
            > [Delete me] Testing steps
            
            ## Related :chains:
            > [Delete me] The list of related issues or pull requests
            
            ## Remark :eyes:
            > [Delete me] Any remarks
        EOT
        id                              = "tfgh/.github/pull_request_template.md"
        # (10 unchanged attributes hidden)
    }

  # module.repositories["tfgh"].github_repository_pull_request.managed will be replaced due to changes in replace_triggered_by
-/+ resource "github_repository_pull_request" "managed" {
      ~ base_sha              = "35a183fc52dd96d139c9708b743142e22815b0a9" -> (known after apply)
      ~ draft                 = false -> (known after apply)
      ~ head_sha              = "58dd8ea11b67ee57a79eb5169e8c400a0fe6d412" -> (known after apply)
      ~ id                    = "hayas1:tfgh:75" -> (known after apply)
      ~ labels                = [
          - "no-changes",
          - "manual",
          - "maintenance",
        ] -> (known after apply)
      ~ number                = 75 -> (known after apply)
      ~ opened_at             = 1731818013 -> (known after apply)
      ~ opened_by             = "terraform-apply[bot]" -> (known after apply)
      ~ state                 = "closed" -> (known after apply)
      ~ updated_at            = 1731818510 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.repositories["tokei-toukei"].github_repository_file.this["github/issue_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content             = <<-EOT
          - <!-- Managed by terraform. https://github.com/hayas1/tfgh -->
          + <!-- This template is managed by terraform. https://github.com/hayas1/tfgh -->
            
            ## Expectation :butterfly:
            > [Delete me] What behavior is expected?
            
            ## Reality :bug:
            > [Delete me] How does it actually work?
            
            ## Environment :evergreen_tree:
            > [Delete me] (When and) Where the behavior was observed?
            
            ## Cause :mag:
            > [Delete me] Why this issue was occurred?
            
            ## Related :chains:
            > [Delete me] The list of related issues or pull requests
            
            ## Remark :eyes:
            > [Delete me] Any remarks
        EOT
        id                  = "tokei-toukei/.github/issue_template.md"
        # (8 unchanged attributes hidden)
    }

  # module.repositories["tokei-toukei"].github_repository_file.this["github/pull_request_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content             = <<-EOT
          - <!-- Managed by terraform. https://github.com/hayas1/tfgh -->
          + <!-- This template is managed by terraform. https://github.com/hayas1/tfgh -->
            
            ## Overview :rocket:
            > [Delete me] What is this pull request?
            
            ## Implementation :clamp:
            > [Delete me] How to realize ?
            
            ## Use cases :chopsticks:
            > [Delete me] Why this pull request was created?
            
            ## Testing :gear:
            > [Delete me] Testing steps
            
            ## Related :chains:
            > [Delete me] The list of related issues or pull requests
            
            ## Remark :eyes:
            > [Delete me] Any remarks
        EOT
        id                  = "tokei-toukei/.github/pull_request_template.md"
        # (8 unchanged attributes hidden)
    }

  # module.repositories["tokei-toukei"].github_repository_pull_request.managed will be replaced due to changes in replace_triggered_by
-/+ resource "github_repository_pull_request" "managed" {
      ~ base_sha              = "d0b3dbb3471c681e30c750be2eba289e1e17593e" -> (known after apply)
      ~ draft                 = false -> (known after apply)
      ~ head_sha              = "51f046fcff222e92b0727d38895bffb020c7308a" -> (known after apply)
      ~ id                    = "hayas1:tokei-toukei:27" -> (known after apply)
      ~ labels                = [
          - "maintenance",
        ] -> (known after apply)
      ~ number                = 27 -> (known after apply)
      ~ opened_at             = 1731818019 -> (known after apply)
      ~ opened_by             = "terraform-apply[bot]" -> (known after apply)
      ~ state                 = "open" -> (known after apply)
      ~ updated_at            = 1731818030 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 10 to add, 7 to change, 4 to destroy.
module.repositories["dyson-rs"].github_repository_pull_request.managed: Destroying... [id=hayas1:dyson-rs:11]
module.repositories["tokei-toukei"].github_repository_pull_request.managed: Destroying... [id=hayas1:tokei-toukei:27]
module.repositories["tfgh"].github_repository_pull_request.managed: Destroying... [id=hayas1:tfgh:75]
module.repositories["json-with-comments"].github_repository_pull_request.managed: Destroying... [id=hayas1:json-with-comments:46]
module.repositories["tfgh"].github_repository_pull_request.managed: Destruction complete after 0s
module.repositories["devcontainer-features"].github_repository_file.this["github/labeler.yml"]: Creating...
module.repositories["devcontainer-features"].github_repository_file.this["github/pull_request_template.md"]: Creating...
module.repositories["devcontainer-features"].github_repository_file.this["github/workflows/labeler.yml"]: Creating...
module.repositories["devcontainer-features"].github_repository_file.this["github/issue_template.md"]: Creating...
module.repositories["devcontainer-features"].github_repository_file.this["github/release.yml"]: Creating...
module.repositories["tfgh"].github_repository_file.this["github/pull_request_template.md"]: Modifying... [id=tfgh/.github/pull_request_template.md]
module.repositories["tfgh"].github_repository_file.this["github/issue_template.md"]: Creating...
module.repositories["dyson-rs"].github_repository_pull_request.managed: Destruction complete after 1s
module.repositories["dyson-rs"].github_repository_file.this["github/issue_template.md"]: Modifying... [id=dyson-rs/.github/issue_template.md]
module.repositories["tokei-toukei"].github_repository_pull_request.managed: Destruction complete after 2s
module.repositories["dyson-rs"].github_repository_file.this["github/pull_request_template.md"]: Modifying... [id=dyson-rs/.github/pull_request_template.md]
module.repositories["json-with-comments"].github_repository_pull_request.managed: Destruction complete after 4s
module.repositories["tokei-toukei"].github_repository_file.this["github/pull_request_template.md"]: Modifying... [id=tokei-toukei/.github/pull_request_template.md]
module.repositories["tokei-toukei"].github_repository_file.this["github/issue_template.md"]: Modifying... [id=tokei-toukei/.github/issue_template.md]
module.repositories["json-with-comments"].github_repository_file.this["github/pull_request_template.md"]: Modifying... [id=json-with-comments/.github/pull_request_template.md]
module.repositories["json-with-comments"].github_repository_file.this["github/issue_template.md"]: Modifying... [id=json-with-comments/.github/issue_template.md]
module.repositories["tfgh"].github_repository_file.this["github/pull_request_template.md"]: Still modifying... [id=tfgh/.github/pull_request_template.md, 10s elapsed]
module.repositories["dyson-rs"].github_repository_file.this["github/issue_template.md"]: Still modifying... [id=dyson-rs/.github/issue_template.md, 10s elapsed]
module.repositories["dyson-rs"].github_repository_file.this["github/pull_request_template.md"]: Still modifying... [id=dyson-rs/.github/pull_request_template.md, 10s elapsed]
module.repositories["tokei-toukei"].github_repository_file.this["github/pull_request_template.md"]: Still modifying... [id=tokei-toukei/.github/pull_request_template.md, 10s elapsed]
module.repositories["tokei-toukei"].github_repository_file.this["github/issue_template.md"]: Still modifying... [id=tokei-toukei/.github/issue_template.md, 10s elapsed]
module.repositories["json-with-comments"].github_repository_file.this["github/pull_request_template.md"]: Still modifying... [id=json-with-comments/.github/pull_request_template.md, 10s elapsed]
module.repositories["json-with-comments"].github_repository_file.this["github/issue_template.md"]: Still modifying... [id=json-with-comments/.github/issue_template.md, 10s elapsed]
module.repositories["tfgh"].github_repository_file.this["github/pull_request_template.md"]: Still modifying... [id=tfgh/.github/pull_request_template.md, 20s elapsed]
module.repositories["dyson-rs"].github_repository_file.this["github/issue_template.md"]: Still modifying... [id=dyson-rs/.github/issue_template.md, 20s elapsed]
module.repositories["dyson-rs"].github_repository_file.this["github/issue_template.md"]: Modifications complete after 20s [id=dyson-rs/.github/issue_template.md]
module.repositories["dyson-rs"].github_repository_file.this["github/pull_request_template.md"]: Modifications complete after 19s [id=dyson-rs/.github/pull_request_template.md]
module.repositories["tokei-toukei"].github_repository_file.this["github/pull_request_template.md"]: Modifications complete after 18s [id=tokei-toukei/.github/pull_request_template.md]
module.repositories["tokei-toukei"].github_repository_file.this["github/issue_template.md"]: Modifications complete after 17s [id=tokei-toukei/.github/issue_template.md]
module.repositories["json-with-comments"].github_repository_file.this["github/pull_request_template.md"]: Modifications complete after 17s [id=json-with-comments/.github/pull_request_template.md]
module.repositories["json-with-comments"].github_repository_file.this["github/issue_template.md"]: Modifications complete after 17s [id=json-with-comments/.github/issue_template.md]
module.repositories["tfgh"].github_repository_file.this["github/pull_request_template.md"]: Modifications complete after 23s [id=tfgh/.github/pull_request_template.md]

Error: unexpected status code: 404 Not Found

  with module.repositories["devcontainer-features"].github_repository_file.this["github/pull_request_template.md"],
  on module/repository/files.tf line 35, in resource "github_repository_file" "this":
  35: resource "github_repository_file" "this" {


Error: unexpected status code: 404 Not Found

  with module.repositories["devcontainer-features"].github_repository_file.this["github/labeler.yml"],
  on module/repository/files.tf line 35, in resource "github_repository_file" "this":
  35: resource "github_repository_file" "this" {


Error: unexpected status code: 404 Not Found

  with module.repositories["devcontainer-features"].github_repository_file.this["github/workflows/labeler.yml"],
  on module/repository/files.tf line 35, in resource "github_repository_file" "this":
  35: resource "github_repository_file" "this" {


Error: unexpected status code: 404 Not Found

  with module.repositories["devcontainer-features"].github_repository_file.this["github/release.yml"],
  on module/repository/files.tf line 35, in resource "github_repository_file" "this":
  35: resource "github_repository_file" "this" {


Error: unexpected status code: 404 Not Found

  with module.repositories["devcontainer-features"].github_repository_file.this["github/issue_template.md"],
  on module/repository/files.tf line 35, in resource "github_repository_file" "this":
  35: resource "github_repository_file" "this" {


Error: unexpected status code: 404 Not Found

  with module.repositories["tfgh"].github_repository_file.this["github/issue_template.md"],
  on module/repository/files.tf line 35, in resource "github_repository_file" "this":
  35: resource "github_repository_file" "this" {

::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":77,"Program":"tfcmt","SHA1":"5c04e8d30193b02717adec19caf6df406a8d8701","Vars":{},"WorkflowName":"Terraform apply on push"} -->